{"modelTopology":{"class_name":"Model","config":{"name":"model4","layers":[{"name":"input4","class_name":"InputLayer","config":{"batch_input_shape":[null,3],"dtype":"float32","sparse":false,"name":"input4"},"inbound_nodes":[]},{"name":"embedding_Embedding4","class_name":"Embedding","config":{"input_dim":168,"output_dim":50,"embeddings_initializer":{"class_name":"VarianceScaling","config":{"scale":2,"mode":"fan_in","distribution":"normal","seed":null}},"embeddings_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.000001}},"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"embedding_Embedding4","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["input4",0,0,{}]]]},{"name":"dense_Dense19","class_name":"Dense","config":{"units":250,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense19","trainable":true},"inbound_nodes":[[["embedding_Embedding4",0,0,{}]]]},{"name":"dense_Dense20","class_name":"Dense","config":{"units":250,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense20","trainable":true},"inbound_nodes":[[["dense_Dense19",0,0,{}]]]},{"name":"flatten_Flatten4","class_name":"Flatten","config":{"name":"flatten_Flatten4","trainable":true},"inbound_nodes":[[["dense_Dense20",0,0,{}]]]},{"name":"dense_Dense21","class_name":"Dense","config":{"units":750,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense21","trainable":true},"inbound_nodes":[[["flatten_Flatten4",0,0,{}]]]},{"name":"dense_Dense22","class_name":"Dense","config":{"units":500,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense22","trainable":true},"inbound_nodes":[[["dense_Dense21",0,0,{}]]]},{"name":"dense_Dense23","class_name":"Dense","config":{"units":250,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense23","trainable":true},"inbound_nodes":[[["dense_Dense22",0,0,{}]]]},{"name":"dense_Dense24","class_name":"Dense","config":{"units":168,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense24","trainable":true},"inbound_nodes":[[["dense_Dense23",0,0,{}]]]}],"input_layers":[["input4",0,0]],"output_layers":[["dense_Dense24",0,0]]},"keras_version":"tfjs-layers 3.20.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.20.0","convertedBy":null,"weightsManifest":[{"paths":["./model.weights.bin"],"weights":[{"name":"embedding_Embedding4/embeddings","shape":[168,50],"dtype":"float32"},{"name":"dense_Dense19/kernel","shape":[50,250],"dtype":"float32"},{"name":"dense_Dense19/bias","shape":[250],"dtype":"float32"},{"name":"dense_Dense20/kernel","shape":[250,250],"dtype":"float32"},{"name":"dense_Dense20/bias","shape":[250],"dtype":"float32"},{"name":"dense_Dense21/kernel","shape":[750,750],"dtype":"float32"},{"name":"dense_Dense21/bias","shape":[750],"dtype":"float32"},{"name":"dense_Dense22/kernel","shape":[750,500],"dtype":"float32"},{"name":"dense_Dense22/bias","shape":[500],"dtype":"float32"},{"name":"dense_Dense23/kernel","shape":[500,250],"dtype":"float32"},{"name":"dense_Dense23/bias","shape":[250],"dtype":"float32"},{"name":"dense_Dense24/kernel","shape":[250,168],"dtype":"float32"},{"name":"dense_Dense24/bias","shape":[168],"dtype":"float32"}]}]}